const Constants = {
  URL: 'http://talabeety.com/',
  CONTENT_URL: 'http://talabeety.com/content/',
  STORE_TYPE: 1,
  MEDICAL_SUPPLIES_TYPE: 2,
  New: 1,
  Approved: 2,
  Live: 4,
  Ended: 8,
  Closed: 16,
  Rejected: 64,
  AdminID: '2',
  NextItemFlag: 1,
  CancelItemFlag: 0,
  BaghdadID: 1,
  BasraID: 2,
  KirkukID: 3,
  ErbilID: 4,
  NajafID: 5,
  KarbalaID: 6,
  SulaymaniyaID: 7,
  DahookID: 8,
  NenwaID: 9,
  SalahAlDeenID: 10,
  AlAnbarID: 11,
  BabelID: 12,
  DeyaliID: 13,
  WasetID: 14,
  AlQadseyaID: 15,
  AlMothanaID: 16,
  TheQarID: 17,
  MesanID: 18,
  USER_STORE_STATUSES: {
    NOT_REQUESTED: '0',
    REQUESTED: '1',
    ACCEPTED: '2',
  },
  NOTIFICATIONS_STATUSES: {
    chat: '1',
    general: '2',
    product: '3',
  },
  ORDER_STATUSES: {
    Cancelled: -10,
    '-10': 'Cancelled',
    New: 1,
    1: 'New',
    Pending: 2,
    2: 'Pending',
    Paid: 3,
    3: 'Paid',
    Complete: 6,
    6: 'Complete',
  },
  GetCitiesMultiSelect: cities => {
    return [
      {
        children: cities,
      },
    ];
  },
  Cities: [
    {
      children: [
        {
          id: 1,
          name: 'Baghdad',
        },
        {
          id: 2,
          name: 'Basra',
        },
        {
          id: 3,
          name: 'Kirkuk',
        },
        {
          id: 4,
          name: 'Erbil',
        },
        {
          id: 5,
          name: 'Najaf',
        },
        {
          id: 6,
          name: 'Karbala',
        },
        {
          id: 7,
          name: 'Sulaymaniya',
        },
        {
          id: 8,
          name: 'Dahook',
        },
        {
          id: 9,
          name: 'Nenwa',
        },
        {
          id: 10,
          name: 'Salah Al-Deen',
        },
        {
          id: 11,
          name: 'Al Anbar',
        },
        {
          id: 12,
          name: 'Babel',
        },
        {
          id: 13,
          name: 'Deyali',
        },
        {
          id: 14,
          name: 'Waset',
        },
        {
          id: 15,
          name: 'Al Qadseya',
        },
        {
          id: 16,
          name: 'Al Mothana',
        },
        {
          id: 17,
          name: 'The Qar',
        },
        {
          id: 18,
          name: 'Mesan',
        },
      ],
    },
  ],
  ARCities: [
    {
      children: [
        {
          id: 1,
          name: 'بغداد',
        },
        {
          id: 2,
          name: 'البصرة',
        },
        {
          id: 3,
          name: 'كركوك',
        },
        {
          id: 4,
          name: 'أربيل',
        },
        {
          id: 5,
          name: 'النجف',
        },
        {
          id: 6,
          name: 'كربلاء',
        },
        {
          id: 7,
          name: 'السليمانية',
        },
        {
          id: 8,
          name: 'دهوك',
        },
        {
          id: 9,
          name: 'نينوى',
        },
        {
          id: 10,
          name: 'صلاح الدين',
        },
        {
          id: 11,
          name: 'الأنبار',
        },
        {
          id: 12,
          name: 'بابل',
        },
        {
          id: 13,
          name: 'ديالى',
        },
        {
          id: 14,
          name: 'واسط',
        },
        {
          id: 15,
          name: 'القادسية',
        },
        {
          id: 16,
          name: 'المثنى',
        },
        {
          id: 17,
          name: 'ذي قار',
        },
        {
          id: 18,
          name: 'ميسان',
        },
      ],
    },
  ],
  icons: {
    search: {
      name: 'search', // search input
      size: 24,
    },
    arrowUp: {
      name: 'keyboard-arrow-up', // dropdown toggle
      size: 22,
    },
    arrowDown: {
      name: 'keyboard-arrow-down', // dropdown toggle
      size: 22,
    },
    selectArrowDown: {
      name: 'keyboard-arrow-down', // select
      size: 24,
    },
    close: {
      name: 'close', // chip close
      size: 16,
    },
    check: {
      name: 'check', // selected item
      size: 16,
    },
    cancel: {
      name: 'cancel', // cancel button
      size: 18,
    },
  },
  defaultSizeWidth: 390,
  firstCard: {
    height: 64,
    width: 392.7272644042969,
    x: 0,
    y: 40,
  },

  ownerGUID: '33333333-3333-3333-3333-333333333333',
  memberGUID: '44444444-4444-4444-4444-444444444444',

  defaultCities: [
    {
      ID: 2,
      Name: 'بغداد',
      CountryID: 2,
      CountryName: 'العراق',
      Value: '2.00',
      Rank: 10,
      Lat: 0,
      Lon: 0,
      IsCapital: false,
    },
    {
      ID: 3,
      Name: 'البصرة',
      CountryID: 2,
      CountryName: 'العراق',
      Value: '1.00',
      Rank: 10,
      Lat: 0,
      Lon: 0,
      IsCapital: false,
    },
    {
      ID: 4,
      Name: 'كركوك',
      CountryID: 2,
      CountryName: 'العراق',
      Value: '2.00',
      Rank: 10,
      Lat: 0,
      Lon: 0,
      IsCapital: false,
    },
    {
      ID: 5,
      Name: 'أربيل',
      CountryID: 2,
      CountryName: 'العراق',
      Value: '1.00',
      Rank: 10,
      Lat: 0,
      Lon: 0,
      IsCapital: false,
    },
    {
      ID: 6,
      Name: 'النجف',
      CountryID: 2,
      CountryName: 'العراق',
      Value: '1.00',
      Rank: 10,
      Lat: 0,
      Lon: 0,
      IsCapital: false,
    },
    {
      ID: 7,
      Name: 'كربلاء',
      CountryID: 2,
      CountryName: 'العراق',
      Value: '1.00',
      Rank: 10,
      Lat: 0,
      Lon: 0,
      IsCapital: false,
    },
  ],
  privacyPolicyPart1:"شروط وأحكام استخدام التطبيق:نرحّب بكم في تطبيق  Talabeety. تنظم شروط واحكام الاستخدام الخاصه بالتطبيق بمجرد تسجيلك في التطبيق واستخدامه والذي يتضمن كافة الخدمات المقدمه على أو من خلال التطبيق . يؤكد تسجيلك واستخدامك للتطبيق موافقتك الغير مشروطه على الالتزام بهذه الشروط والأحكام والتزامك المستمر بها. وان كنت لاتوافق على اي من و/أو كافة الشروط والأحكام المنصوص عليها فعليك عدم استخدام هذا التطبيق . تنطبق هذه الشروط والأحكام ( الشروط والأحكام ) على التطبيق وعلى جميع اقسامه وفروعه ومواقع الانترنت التابعه له والتي تشير الى هذه الشروط والاحكام كمرجع لها ويحتفظ القائمون على التطبيق بالحق في تغيير اجزاء من شروط الاستخدام والأحكام أو تعديلها أو اضافة معلومات اليها أو ازالتها في أي وقت وتصبح التغييرات سارية النفاذ عندما يتم نشرها على التطبيق دون سابق اشعار . يُرجى مراجعة شروط الاستخدام والأحكام بانتظام للاطلاع على أي تحديثات، ويشكل استخدامك المستمر للموقع - بعد نشر التغييرات الحادثة في هذه الشروط والأحكام الخاصة بالاستخدام – موافقتك التامة على تلك التغييرات . لزيارة هذا التطبيق ، يجب ان لايقل عمرك عن 18 عاماً ولتطبيق Talabeety  الحق في الغاء حساب اي عضو لم يبلغ ال 18 عام. ولايحق لأي شخص استخدام التطبيق اذا أُلغيت عضويته من التطبيق. Talabeety  تمنحك ترخيصاً لكي تستخدم التطبيق بموجب الشروط والأحكام المحددة وتكمن غاية هذا الترخيص في طلب شراء المنتجات المعروضة في المذاخر ومحلات المستلزمات الطبية بشكل عام عن طريق التطبيق Talabeety  ويُحضر الاستخدام لاغراض تجارية و/ أو الاستخدام باسم اي طرف ثالث و/  أو أي استخدام مخالف لأحكام القوانين سارية المفعول والمعمول بها ، باستثناء ما تمَّ السماح به من قبلنا بوضوح وشفافية سلفاً ، ويؤدّي أي خرق لهذه الشروط والأحكام الى منح Talabeety  الحق بالغاء الفوري للترخيص الممنوح في هذه الفقرة من دون أي سابق انذار لك .Talabeety  قد يقدم ايضاً خدمات اخرى والخدمات الجديدة قد تحكمها شروط خدمة مختلفة سيتم تحديدها واضافتها في حينها وفقاً لذلك . عن طريق الوصول او استخدام اي جزء من التطبيق فانك توافق على انك قد قرأت وفهمت ماتم تسجيله وتوافق على الالتزام بهذه الشروط أو السياسات أو القواعد المطبقة على الخدمات أو التطبيقات ( بما في ذلك سياسة الخصوصية ) واذا كنت لاتوافق على ان تكون شروط الخدمة واتباع جميع القوانين والمبادئ التوجيهية والسياسات المعمول بها ملزمة فعليك عدم استخدام التطبيق وترك الأمر على الفور . قد يقوم Talabeety  بتغيير التطبيق أو الخدمة المقدمة أو تعديل أو تعليق أو اجراء تحسينات أو وقف اي جانب من جوانب التطبيق أو الخدمات وذلك بصفة مؤقتة أو دائماً في أي وقت دون سابق انذار لك ولن يلتزم Talabeety  بأدنى مسؤولية تجاه ذلك وفي حال كنت لاتوافق على أي تغييرات يتم اجرائها على التطبيق فعليك ان تقوم بانهاء حسابك واستخدامك للتطبيق وترك الأمر على الفور . قوانين تكنولوجيا الانترنت والقواعد واللوائح تتغير كثيراً وفقاً لذلك ، تحتفظ Talabeety  بالحق في اجراء تغييرات على هذا التطبيق وشروط وأحكام الاستخدام في أي وقت . يحتفظ Talabeety بجميع الحقوق غير الممنوحة لك صراحةً بموجب هذه الاتفاقية ينبغي عليك الالتزام بكافة القوانين المعمول بها لتنظيم التجارة عبر الانترنت .  تتطلب بعض الخدمات والميزات ذات الصلة التي قد تكون متوفرة على الموقع ، التسجيل أو الاشتراك فيها. وباختيارك التسجيل أو الاشتراك في أيّ من هذه الخدمات أو الميزات ذات الصلة فانك توافق على تقديم معلومات دقيقة وحالية عن نفسك وعلى تحديثها في الوقت المناسب اذا طرأت ايّة تغييرات عليها . ويتحمل كل مستخدم للتطبيق – وحده – مسؤولية حفظ كلمة السر وغيرها من أساليب تحديد حساب الاستخدام بطريقة سليمة . وتقع كامل المسؤولية على عاتق صاحب الحساب بالنسبة فيما يخص جميع الانشطة التي تحدث باستخدام كلمة السر الخاصة به أو حسابه بالاضافة الى ذلك ، عليك تبليغنا عن أي استخدام غير مصَّرح به لكلمة السر أو حسابك ولا يعد الموقع مسؤولاً في أي حال من الأحوال بشكل مباشر أو غير مباشر أو بأي شكل من الأشكال عن أيّة خسارة أو أضرار من أي نوع قد تنتج عن تعثرك في الامتثال لهذا القسم أو الاتصال به . أثناء عملية التسجيل ، يوافق العميل على تلقي رسائل الكترونية ترويجية من قبل التطبيق ويمكنك في وقت لاحق الغاء هذا الخيار وعدم تلقي أي رسائل الكترونية ترويجية من خلال الخطوات الموضحة بالتطبيق .  لايحق لأي عضو بالتطبيق طلب منتجات ممنوعة أو مشبوهة أو تخالف القوانين المعمول بها بوزارات وهيئات مؤسسات التجارة المحلية الحكومية ، وفي حال ثبوت ذلك فهو يضع نفسه ضمن طائلة المسؤولية الشخصية بدون أدنى مسؤولية على Talabeety  وأي طلب يتم عن طريق التطبيق Talabeety   هو مسؤولية المستخدم كاملة ولا علاقه للتطبيق Talabeety  أو أي من القائمين عليه بالطلبات سواء نوع الطلب أو المنتج أو الهدف من استخدامه ويلتزم المستخدم للتطبيق بأن يراعي القوانين والقواعد العامة للطلبات وأنواعها وما يقره القانون بصلاحيتها للطلب وشروط تداولها . لايتحمل التطبيق أي مسؤولية عن أي منتج يتم ارساله من المتجر الى مستخدم التطبيق سواء نوع المنتج أو جودة وسلامة المنتج أو صلاحية المنتج أو مشروعية وقانونية المنتج المرسل كذلك لايتحمل التطبيق أجور النقل ويتحمل المتجر المرسل للطلب المسؤولية كاملة عن كل التفاصيل الخاصة بالمنتج ولايحق لأي مستخدم للتطبيق أن يعود على التطبيق في أي مسؤولية متعلقة بالمنتج المطلوب . انت توافق على أن استخدامك للتطبيق يجب أن يكون على مسؤوليتك وحدك الى أقصى حد يسمح به القانون وأن Talabeety  والمالكين والمديرين والموضفين والوكلاء والمساهمين غير مسؤولين عن أية ضمانات صريحة أو ضمنية . فيما يتعلق بالخدمات المقدمة عن طريق التطبيق ، فالتطبيق لايقدم أي ضمانات أو تأكيدات حول دقة أو اكتمال محتوى هذا التطبيق أو محتوى أي مواقع مرتبطة به ، ولايتحمل أي التزام أو مسؤولية عن أي أخطاء أو عدم دقة المحتوى . كذلك فان الملفات والمحتويات الأخرى في الخدمات على التطبيق قد تكون محمية بموجب حقوق الملكية الفكرية للآخرين بالاضافة الى الخصوصية ، لذا يُرجى عدم نسخ أو تحميل أو تنزيل أو مشاركة الملفات الااذا كان لديك الحق في القيام بذلك .أثناء استخدام الخدمات فأنت المسؤول عن صيانة وحماية جميع البيانات الخاصة بك ولن يكون تطبيق Talabeety  مسؤولاً عن أي خسارة أو تلف للبيانات الخاصة بك ولايتحمل أي تكاليف أو نفقات مرتبطة بالنسخ الاحتياطي أو استعادة أي من البيانات الخاصة بك .  اذا حدث تغييرات بخصوص معلومات الاتصال الخاصة بك أو المعلومات الأخرى ذات الصلة الى حسابك فيجب أن تخطرنا على وجه السرعة بذلك للحفاظ على المعلومات الحالية الخاصة بك . فور تقديم طلب التسجيل للحصول على عضوية في التطبيق تكون مطالباً بالافصاح عن معلومات محددة واختيار اسم مستخدم وكلمة مرور سرية لاستعمالها عند الدخول للتطبيق وعند قبول طلب التسجيل ستعتبر عضواً بالتطبيق وبذلك تكون قد وافقت على أن تكون مسؤولاً عن المحافظة على سرية معلومات حسابك وكلمة المرور السرية وتحديد الأشخاص المسموح لهم بالوصول واستخدام حسابك بالتطبيق وتكون بذلك موافقاً على اعلام Talabeety  حالاً بأي استخدام غير مفوض به لكلمة دخولك أو حسابك أو أي اختراق آخر لمعلوماتك السرية .  لن يكون تطبيق Talabeety  باي حال من الأحوال مسؤولاً عن أي خسارة قد تلحق بك بشكل مباشر أو غير مباشر معنوياً أو مادياً نتيجة كشف معلومات اسم المستخدم أو كلمة الدخول ، فأنت المسؤول على المحافظة على استخدام تطبيق Talabeety  بكل جدية ومصداقية وتعتبر ملزماً بتعويض Talabeety  عن أي خسائر مباشرة أو غير مباشرة قد تلحق بالتطبيق نتيجة أي استخدام غير شرعي أو حقيقي أو مفوض لحسابك من طرفك أو من طرف أي شخص آخر حصل على مفاتيح الوصول الى حسابك بالتطبيق سواء كان لانجاز خدمات وغيرها باستعمال اسم المستخدم وكلمة الدخول ، سواء بتفويض منك أو بلا تفويض . أنت موافق على الافصاح بمعلومات حقيقة وصحيحة ومحدثة وكاملة عن نفسك حسبما هو مطلوب في استمارة التسجيل لدى Talabeety  ويلتزم تطبيق Talabeety  بالتعامل مع معلوماتك الشخصيىة وعناوين الاتصال بك بسريّة تامة مع الأعضاء الآخرين ( المتاجر ) ويتم تزويد الأعضاء بمعلومات الاتصال بك فقط في حال طلبك لذلك . وسوف تكون ملزماً بالحفاظ على بيانات التسجيل وتحديثها تباعاً للابقاء عليها حقيقة وصحيحة وراهنة وكاملة واذا ما أ فصحت عن معلومات غير حقيقة أو غير صحيحة أو غير راهنة أو غير كاملة أو مخالفة لما جاء في اتفاقية المستخدم ، فان ل  Talabeety الحق كاملاً في وقف أو تحديد أو الغاء عضويتك وحسابك في التطبيق وذلك دون الحاق الأضرار بحقوق Talabeety  الأخرى ووسائله المشروعة في استرداد حقوقه . يجب أن تخطر Talabeety  على الفور اذا كنت تعتقد أنه قد تم سرقة كلمة المرور الخاصة بك أو بحسابك أو يمكن الوصول اليها أو استخدامها من قبل أي شخص أو كيان غير مصرح به .  حسابك يتيح لك الوصول الى الخدمات والوضائف المقدمة من تطبيق Talabeety  والتي يجوز لنا تعديلها وصيانتها من وقت لآخر وحسب تقديرنا وحدنا . أنت موافق على تزويد أي معلومات و/ أو وثائق ل Talabeety  في حال طلب منك ذلك . في حالة عدم الالتزام بأي مما ورد أعلاه فان لادارة تطبيق Talabeety  الحق في ايقاف أو الغاء عضويتك وحجبك عن الموقع ( التطبيق ) ، ونحتفظ كذلك بالحق في الغاء أي حسابات مر عليها مدة طويلة دون نشاط . تفويض بالاتصال بك ، أنت توافق على أن تتصل بك Talabeety  أو المتاجر المرخصة للتعامل مع Talabeety  على رقم الهاتف المحمول الذي تقدمه لتأكيد الطلبية الخاصة بك وجدولة تسلمها . باستخدام الخدمات المقدمة ضمن Talabeety  فانك توافق على استلام اشعارات الرسائل الالكترونية و / أو الرسائل القصيرة sms  ( النصية ) التي تحتوي على معلومات شخصية على جهازك الجوال . يلغى الترخيص الخاص بك لاستخدام التطبيق تلقائياً اذا كنت تنتهك هذه الشروط والأحكام وما يتعلق بحقوق الملكية الفكرية لدينا ونحن نحتفظ بهذا فيما يخص جميع الحقوق غير الممنوحة صراحةً لك في هذه الشروط والأحكام . يجب أن لاتقوم بتعطيل أو فك التطبيق / الموقع فنياً ولا تحاول أن تفعل ذلك ولا يساعدك أي شخص آخر للقيام بذلك .   خدماتنا قد تتطلب تحديث التطبيق على جهازك تلقائياً عندما يتوفر اصدار جديد .  سياسة الملكية الفكرية لدى Talabeety  تحترم حقوق الملكية الفكرية للآخرين ويتوقع من مستخدميها أن يفعلوا الشئ نفسه . قد يقوم Talabeety  بازالة المحتوى الذي يظهر فيه وفقاً لتقديره قيام أحد المستخدمين بالتعدي على حقوق الملكية الفكرية للآخرين ، بالاضافة الى ذلك سوف يقوم Talabeety  في بعض الحالات حسب تقديره بانهاء حسابات المستخدمين الذين ينتهكون حقوق الملكية الفكرية للآخرين . اذا كنت تعتقد أن أحد المستخدمين للتطبيق أو للخدمات المقدمة من التطبيق قد قام بانتهاك حقوق الطبع والنشر وحقوق العلامة التجارية / الخدمة يُرجى ابلاغ Talabeety  باستخدام خدمة البريد الالكتروني أو عن طريق الاتصال بخدمة العملاء في Talabeety  . جميع المعلومات والبيانات والبرامجيات والصور الفوتوغرافية والرسومات والفديو والنصوص والصور والمحارف والأصوات وغيرها من المواد ( يشار اليها مجتمعة ب المحتوى ) بما في ذلك على سبيل المثال لا الحصر اختيار وتنسيق وترتيب وتعزيز هذا المحتوى الواردة في Talabeety   والخدمات تكون مملوكة أو مرخصة من قبل أو لصالح Talabeety  ، تكون محمية بموجب قوانين التجارة وحقوق الطبع والنشر وبراءات الاختراع والعلامات التجارية ومختلف حقوق الملكية الفكرية الأخرى وقوانين المنافسة غير العادلة .  باستثناء ماهو منصوص عليه صراحةً في شروط الاستخدام هذه لايجوز نسخ أي جزء من خدمات Talabeety  وأي محتوى أو اعادة انتاجه أو نقله أو توزيعه بأي شكل من الأشكال ( بما في ذلك النسخ المتطابق ) الى أي جهاز كمبيوتر آخر أو موقع الكتروني أو أي وسيلة أخرى للنشر أو التوزيع أو لأي مؤسسة تجارية دون موافقة خطية صريحة من Talabeety  .  اذا لم يتم عرض قيود محددة ، فيمكنك اجراء نسخ من اجزاء مختارة من المحتوى شريطة أن يكون النسخ فقط لمعلوماتك الشخصية والاستخدام غير التجاري ، وانك لاتغير أو تعدل المحتوى بأي شكل من الأشكال والحفاظ على أي اشعارات مضمنة في المحتوى مثل جميع اشعارات حقوق الطبع والنشر أو العلامات التجارية أو اشعارات حقوق الملكية الأخرى .  ان مشاركتك على الموقع و/ أو ما تقدمه لنا بما في ذلك – على سبيل المثال وليس الحصر – الأسئلة والأنتقادات والتعليقات والاقتراحات ( مجتمعين في لفظة المشاركات ) فبمجرد أنك تشاركنا بتعليقاتك أو انتقاداتك على الموقع / التطبيق فانك تمنحنا ايضاً حق استخدام الأسم الذي تعرضه والمرتبط مباشرةً بهذا النقد أو التعليق أو أي محتوى آخر . لايحق لك استخدام عنوان مزيف للبريد الالكتروني أو الادعاء بأنك شخصٌ آخر أو محاولة تضليلنا أو أي طرف ثالث فيما يتعلق بأصالة وموثوقيّة أي من المشاركات ويجوز لنا حذف أيّ من المشاركات أو تعديلها غير اننا لسنا ملزمين بذلك",

  privacyPolicyPart2 : "Download now Talabeety",

  privacyPolicyPart3 : "Talabeety is a free service that facilitates communication between Drug stores, Medical appliances stores, and Pharmacies.This process helps all pharmacies to get their right orders faster instead of seeking all Drug stores or medical appliances stores. Our target is to use the new technology to give more value to the Iraqi community in terms of comfort and security.Copyright © 2022, All rights reserved.TERMS PRIVACY",

  privacyPolicy2: "شروط واحكام استخدام التطبيق نرحّب بكم في تطبيق Talabeety . تنظم شروط وأحكام الاستخدام الخاصة بالتطبيق بمجرد تسجيلك في التطبيق واستخدامه والذي يتضمن كافة الخدمات المقدمة على أو من خلال التطبيق. يؤكد تسجيلك واستخدامك للتطبيق موافقتك الغير المشروطة على الالتزام بهذه الشروط والاحكام والتزامك المستمر بها. وإن كنت لا توافق على اي من و/أو كافة الشروط والاحكام المنصوص عليها، فعليك عدم استخدام هذا التطبيق. تنطبق هذه الشروط والأحكام (الشروط والأحكام) على التطبيق وعلى جميع أقسامه وفروعه ومواقع الإنترنت التابعة له التي تُشير إلى هذه الشروط والأحكام كمرجعٍ لها، ويحتفظ القائمون على التطبيق بالحق في تغيير أجزاء من شروط الاستخدام والأحكام أو تعديلها أو إضافة معلومات إليها أو إزالتها في أي وقت ، وتصبح التغييرات سارية النفاذ عندما يتم نشرها على التطبيق دون سابق إشعار. يُرجى مراجعة شروط الاستخدام والأحكام بانتظام للاطلاع على أي تحديثات ، ويشكِّل استخدامك المستمر للموقع ــ بعد نشر التغييرات الحادثة في هذه الشروط والأحكام الخاصة بالاستخدام ــ موافقتك التامة على تلك التغييرات. لزيارة هذا التطبيق، يجب أن لا يقل عمرك عن 18 عاما. لتطبيق Talabeety    الحق في إلغاء حساب اي عضو لم يبلغ ال 18 عام. لا يحق لأي شخص إستخدام التطبيق إذا ألغيت عضويته من التطبيق.  Talabeety   تمنحك ترخيصاً لكي تستخدم التطبيق بموجب الشروط والأحكام المحدَّدة. وتكمن غاية هذا الترخيص في طلب شراء المنتجات المعروضة في المذاخر ومحلات المستلزمات الطبية بشكل عام عن طريق التطبيق Talabeety ويُحظر الاستخدام لأغراض تجارية و/أو الاستخدام باسم أي طرف ثالث و/أو اي استخدام مخالف لأحكام القوانين سارية المفعول والمعمول بها، باستثناء ما تمَّ السماح به من قبلنا بوضوح وشفافية سلفًا. ويؤدِّي أي خرق لهذه الشروط والأحكام إلى منح Talabeety  الحق بإلغاء الفوري للترخيص الممنوح في هذه الفقرة من دون أي سابق إنذار لك. قد يقدم أيضا خدمات أخرى أو الخدمات الجديدة التي قد تحكمها شروط خدمة مختلفة سيتم تحديدها وأضافتها في حينها وفقا لذلك . عن طريق الوصول أو استخدام أي جزء من التطبيق فإنك توافق على أنك قد قرأت وفهمت ما تم تسجيله وتوافق على الالتزام بهذه الشروط أو السياسات أو القواعد المطبقة على الخدمات أو التطبيقات (بما في ذلك سياسة الخصوصية) وإذا كنت لا توافق على أن تكون شروط الخدمة واتباع جميع القوانين والمبادئ التوجيهية والسياسات المعمول بها ملزمة فعليك عدم استخدام التطبيق وترك الأمر على الفور قد يقوم Talabeety بتغير التطبيق او الخدمة المقدمة او تعديل او تعليق او اجراء تحسينات او وقف أي جانب من جوانب التطبيق او الخدمات وذلك بصفة مؤقتة او دائما في أي وقت دون سابق انذار لك ولن يلتزم Talabeety بأدنى مسؤولية تجاه ذلك وفى حال كنت لا توافق على أي تغيرات يتم اجرائها على التطبيق فعليك ان تقوم بإنهاء حسابك واستخدامك للتطبيق وترك الامر على الفور. قوانين تكنولوجيا الإنترنت والقواعد واللوائح تتغير كثيرا وفقا لذلك، تحتفظ Talabeety بالحق في إجراء تغييرات على هذا التطبيق وشروط وأحكام الاستخدام في أي وقت. يحتفظ Talabeety بجميع الحقوق غير الممنوحة لك صراحة بموجب هذه الاتفاقية ينبغي عليك الالتزام بكافة القوانين المعمول بها لتنظيم التجارة عبر الانترنت.  تتطلب بعض الخدمات والميزات ذات الصلة التي قد تكون متوفرة على الموقع التسجيل أو الاشتراك فيها. وباختيارك التسجيل أو الاشتراك في أيّ من هذه الخدمات أو الميزات ذات الصلة، فإنَّك توافق على تقديم معلومات دقيقة وحالية عن نفسك وعلى تحديثها في الوقت المناسب إذا طرأت أيّة تغييرات عليها. ويتحمَّل كُلّ مستخدم للتطبيق ــ وحده ــ مسؤولية حفظ كلمات السر وغيرها من أساليب تحديد حساب الاستخدام بطريقة سليمة. وتقع كامل المسؤولية على عاتق صاحب الحساب بالنسبة فيما يخص جميع الأنشطة التي تحدث باستخدام كلمة السر الخاصة به أو حسابه. بالإضافة إلى ذلك، عليك تبليغنا عن أي استخدام غير مصرَّح به لكلمة السر أو حسابك. ولا يُعد الموقع مسؤولاً في أي حال من الأحوال، بشكل مباشر أو غير مباشرٍ أو بأي شكل من الأشكال، عن أيّة خسارة أو أضرار من أي نوع، قد تنتُج عن تعثرك في الامتثال لهذا القِسم أو الاتصال به. أثناء عملية التسجيل، يوافق العميل على تلقِّي رسائل إلكترونية ترويجية من قِبل التطبيق. ويمكنك في وقت لاحق إلغاء هذا الخيار وعدم تلقي أي رسائل إلكترونية ترويجية من خلال الخطوات الموضحة بالتطبيق . لا يحق لأي عضو بالتطبيق طلب منتجات ممنوعة أو مشبوهة أو تخالف القوانين المعمول بها بوزارات و هيئات مؤسسات التجارة المحلية الحكومية، وفي حال ثبوت ذلك فهو يضع نفسه ضمن طائلة المسؤولية الشخصية بدون أدنى مسؤولية على    Talabeety اي طلب يتم عن طريق التطبيق Talabeety   هو مسؤولية المستخدم كامله ولا علاقه للتطبيق  Talabeety او اي من القائمين عليه بالطلبات سواء نوع الطلب او المنتج او الهدف من استخدامه ويلتزم المستخدم للتطبيق بان يراعي القوانين والقواعد العامة للطلبات وانواعها وما يقره القانون بصلاحيتها للطلب وشروط تداولها لا يتحمل التطبيق أي مسؤولية عن أي منتج يتم ارساله من المتجر الى مستخدم التطبيق سواء نوع المنتج او جودة وسلامة المنتج او صلاحية المنتج او مشروعية وقانونية المنتج المرسل كذلك لا يتحمل التطبيق أجور النقل ويتحمل المتجر المرسل للطلب المسؤوليه كامله عن كل التفاصيل الخاصة بالمنتج ولا يحق لأي مستخدم للتطبيق أن يعود على التطبيق في اي مسؤوليه متعلقة بالمنتج المطلوب . انت توافق على أن استخدامك للتطبيق يجب أن يكون على مسؤوليتك وحدك إلى أقصى حد يسمح به القانون وان     Talabeety  والمالكين والمديرين والموظفين والوكلاء والمساهمين غير مسؤولين عن أية ضمانات صريحة أو ضمنية، فيما يتعلق بالخدمات المقدمة عن طريق التطبيق. لا يقدم التطبيق  أي ضمانات أو تأكيدات حول دقة أو اكتمال محتوى هذا التطبيق أو محتوى أي مواقع مرتبطة به، ولا يتحمل أي التزام أو مسؤولية عن أي أخطاء أو عدم دقة المحتوى أن الملفات والمحتويات الأخرى في الخدمات على التطبيق قد تكون محمية بموجب حقوق الملكية الفكرية للآخرين بالإضافة إلى الخصوصية ولذا يرجى عدم نسخ أو تحميل أو تنزيل أو مشاركة الملفات إلا إذا كان لديك الحق في القيام بذلك ، وليس على Talabeety اي مسؤولية بشكل كامل لما قمت به من نسخ او تحميل وتنزيل أو استخدام أثناء استخدام الخدمات. انت المسؤول عن صيانة وحماية جميع البيانات الخاصة بك. Talabeety لن تكون مسؤولة عن أي خسارة أو تلف البيانات الخاصة بك، أو عن أي تكاليف أو نفقات مرتبطة بالنسخ الاحتياطي أو استعادة أي من البيانات الخاصة بك. اذا حدث تغييرات بخصوص معلومات الاتصال الخاصة بك أو المعلومات الأخرى ذات الصلة إلى حسابك، يجب أن تخطرنا على وجه السرعة بذلك للحفاظ على المعلومات الحالية الخاصة بك. فور تقديم طلب التسجيل للحصول على عضوية في التطبيق تكون مطالباً بالإفصاح عن معلومات محددة واختيار اسم مستخدم وكلمة مرور سرية لاستعمالها عند الدخول للتطبيق. وعند قبول طلب التسجيل ستعتبر عضوا بالتطبيق وبذلك تكون قد وافقت على : أن تكون مسؤولاً عن المحافظة على سرية معلومات حسابك وكلمة المرور السرية وتحديد الأشخاص المسموح لهم بالوصول واستخدام حسابك بالتطبيق وتكون بذلك موافقاً على إعلام Talabeety حالاً بأي استخدام غير مفوض به لكلمة دخولك أو حسابك أو أي اختراق آخر لمعلوماتك السرية. لن يكون Talabeety بأي حال من الأحوال مسؤولاً عن أي خسارة قد تلحق بك بشكل مباشر أو غير مباشر معنويا أو ماديا نتيجة كشف معلومات اسم المستخدم أو كلمة الدخول فانت مسؤول على المحافظة على استخدام تطبيق Talabeety بكل جدية و مصداقية وتعتبر ملزما بتعويض Talabeety عن أي خسائر مباشرة أو غير مباشرة قد تلحق بالتطبيق نتيجة أي استخدام غير شرعي أو حقيقي أو مفوض لحسابك من طرفك أو من طرف أي شخص آخر حصل على مفاتيح الوصول إلى حسابك بالتطبيق سواء كان لإنجاز خدمات وغيرها باستعمال اسم المستخدم وكلمة الدخول، سواء بتفويض منك أو بلا تفويض. أنت موافق على الإفصاح بمعلومات حقيقية وصحيحة و محدثة و كاملة عن نفسك حسبما هو مطلوب في استمارة التسجيل لدى Talabeety يلتزم Talabeety بالتعامل مع معلوماتك الشخصية وعناوين الاتصال بك بسريّة تامة مع الأعضاء الآخرين المتاجر ويتم تزويد الأعضاء بمعلومات الاتصال بك فقط فور إتمام العمليات التجارية. سوف تكون ملزماً بالحفاظ على بيانات التسجيل وتحديثها تباعاً للإبقاء عليها حقيقية وصحيحة وراهنة وكاملة، وإذا ما أفصحت عن معلومات غير حقيقية أو غير صحيحة أوغير راهنة أوغير كاملة او مخالفة لما جاء في اتفاقية المستخدم، فإن لـ  Talabeety الحق كاملاً في وقف أو تحديد أو إلغاء عضويتك و حسابك في التطبيق، وذلك دون الحاق الأضرار بحقوق  Talabeety الأخرى ووسائله المشروعة في استرداد حقوقه. يجب أن تخطر Talabeety على الفور إذا كنت تعتقد أنه قد تم سرقة كلمة المرور الخاصة بك أو حسابك أو يمكن الوصول إليها أو استخدامها من قبل أي شخص أو كيان غير المصرح به. حسابك يتيح لك الوصول إلى الخدمات والوظائف المقدمة من تطبيقTalabeety ,والتي يجوز لنا تعديلها وصيانتها من وقت لآخر وحسب تقديرنا وحدنا أنت موافق على تزويد أي معلومات و/أو وثائق ل Talabeety  في حال طلب منك ذلك. في حالة عدم الإلتزام بأي مما ورد إعلاه فإن لإدارة Talabeety الحق في إيقاف أو إلغاء عضويتك و حجبك عن الموقع/التطبيق. ونحتفظ كذلك بالحق في إلغاء أي حسابات غير مؤكدة وغير مثبتة أو عمليات أو حسابات مر عليها مدة طويلة دون نشاط. تفويض بالاتصال بك أنت توافق على أن تتصل بك Talabeety او المتاجر المرخصة للتعامل مع Talabeetyعلى رقم الهاتف المحمول الذي تقدمه لتأكيد الطلبية الخاصة بك وجدولة تسلمها باستخدام الخدمات المقدمة جمن Talabeety فإنك توافق على استلام إشعارات الرسائل الإلكترونية و / أو الرسائل القصيرة sms (النصية) التي تحتوي على معلومات شخصية على جهازك الجوال حتى وان كان ذلك عبر قناة غير آمنة مادام هذا هو اختيارك الشخصي، ونحن نشجعكم على حماية هذه المعلومات بعناية أنت موافق على الإفصاح بمعلومات حقيقية وصحيحة و محدثة و كاملة عن نفسك حسبما هو مطلوب في استمارة التسجيل لدى Talabeety  التطبيق والتحديثات أثناء استخدام الخدمه لدينا قد يتطلب منك تحميل حزمة تطبيق العميل ( التطبيق ) Talabeety   الذي يمنحك ترخيص قابل للإلغاء لاستخدام التطبيق، فقط للوصول إلى الخدمات يلغى الترخيص الخاص بك لاستخدام التطبيق تلقائيا إذا كنت تنتهك هذه الشروط وما يتعلق بحقوق الملكية الفكرية لدينا ونحن نحتفظ بهذا فيما يخص جميع الحقوق غير الممنوحة صراحة لك في هذه الشروط والاحكام. يجب أن لا تقوم بتعطيل او فك التطبيق/الموقع فنيا ولا تحاول أن تفعل ذلك ولا يساعدك أي شخص آخر للقيام بذلك. خدماتنا قد تتطلب تحديث التطبيق على جهازك تلقائيا عندما يتوفر إصدار جديد. لدينا ميزة المزامنة وقفة توقف المزامنة من الملفات الخاصة بك ولكن قد لا تتوقف عن نقل البيانات، لذا يجب عليك اعادة ضبط الجهاز الخاص بك إذا كنت ترغب في وقف نقل البيانات او التحديثات. سياسة الملكية الفكرية Talabeety تحترم حقوق الملكية الفكرية للآخرين ويتوقع من مستخدميها أن تفعل الشيء نفسه. قد يقوم Talabeety بازالة المحتوى الذي يظهر وفقا لتقديره اذا قام احد المستخدمين بالتعدي على حقوق الملكية الفكرية للآخرين. بالإضافة إلى ذلك سوف يقوم Talabeety في بعض الحالات حسب تقديره بإنهاء حسابات المستخدمين الذين ينتهكون حقوق الملكية الفكرية للآخرين. إذا كنت تعتقد أن احد المستخدمين للتطبيق أو الخدمات المقدمة من التطبيق قد قام بانتهاك حقوق الطبع والنشر وحقوق العلامة التجارية / الخدمة يرجى إبلاغ Talabeety باستخدام خدمة البريد الإلكتروني أو عن طريق الاتصال بخدمة العملاء في Talabeety جميع المعلومات والبيانات والبرمجيات والصور الفوتوغرافية والرسومات والفيديو والنصوص والصور والمحارف والأصوات وغيرها من المواد (يشار إليها مجتمعة ب المحتوى)، بما في ذلك على سبيل المثال لا الحصر اختيار وتنسيق وترتيب وتعزيز هذا المحتوى، الواردة في Talabeetyوالخدمات مملوكة أو مرخصة أو مرخصة من قبل أو لصالح Talabeety محمية بموجب قوانين التجارة وحقوق الطبع والنشر وبراءات الاختراع والعلامات التجارية ومختلف حقوق الملكية الفكرية الأخرى وقوانين المنافسة غير العادلة. باستثناء ما هو منصوص عليه صراحة في شروط الاستخدام هذه لا يجوز نسخ أي جزء من خدمات Talabeety وأي محتوى أو إعادة إنتاجه أو إعادة نشره أو تحميله أو عرضه أو ترجمته أو نقله أو توزيعه بأي شكل من الأشكال (بما في ذلك النسخ المتطابق) إلى أي جهاز كمبيوتر آخر أو موقع إلكتروني أو أي وسيلة أخرى للنشر أو التوزيع أو لأي مؤسسة تجارية، دون موافقة خطية صريحة من Talabeety. لا يجوز لك تعديل أو حذف أو زيادة أو إضافة أو نشر أو نقل أو المشاركة في نقل أو بيع أو إنشاء أعمال مشتقة من أو بأي شكل من الأشكال استغلال أي من المحتوى، كليا أو جزئيا. إذا لم يتم عرض قيود محددة، يمكنك إجراء نسخ من أجزاء مختارة من المحتوى، شريطة أن تكون النسخ فقط لمعلوماتك الشخصية والاستخدام غير التجاري، وأنك لا تغير أو تعدل المحتوى بأي شكل من الأشكال والحفاظ على أي إشعارات مضمنة في المحتوى، مثل جميع إشعارات حقوق الطبع والنشر أو العلامات التجارية أو إشعارات حقوق الملكية الأخرى.  إنّ مشاركاتك على الموقع و/أو ما تقدمه لنا، بما في ذلك ــ على سبيل المثال وليس الحصرــ الأسئلة والانتقادات والتعليقات والاقتراحات (مجتمعين في لفظة المشاركات) تصبح ملكنا الوحيد والحصري، ولا تعود بأي حالٍ من الأحوال ملكاً لك. وفضلاً عن الحقوق التي تنطبق على أي نوع من المشاركات، وبمجرَّد أنَّك تشاركنا بتعليقاتك أو انتقاداتك على الموقع/التطبيق، فإنَّك تمنحنا أيضاً حقّ استخدام الاسم الذي تعرضه والمرتبط مباشرةً بهذا النقد أو التعليق أو أي محتوى آخر. ولا يحق لك استخدام عنوان مزيَّف للبريد الإلكتروني أو الادِّعاء بأنّك شخصٌ آخر أو محاولة تضليلنا أو أي طرف ثالث فيما يتعلَّق بأصالة وموثوقيّة أي من المشاركات. ويجوز لنا حذف أيّ من المشاركات أو  غير أننا لسنا ملزمين بذلك.Download now Talabeety  is a free service that facilitates communication between Drug stores, Medical appliances stores, and Pharmacies.This process helps all pharmacies to get their right orders faster instead of seeking all Drug stores or medical appliances stores.Our target is to use the new technology to give more value to the Iraqi community in terms of comfort and security.",
};

export default Constants;
